Repository: mcraveiro/referencer
Catalog: devhelp/*/*.po
Languages: de

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU General Public License Version 2. You can find a copy of the GPL at this <ulink type="help" url="ghelp:gpl">link</ulink> or in the file COPYING distributed with this manual.
de: Das vorliegende Dokument kann gemäß den Bedingungen der GNU General Public License (GPL), Version 2 kopiert, verteilt und/oder modifiziert werden. Eine Kopie der GPL finden Sie unter diesem <ulink type="help" url="ghelp:gpl">Link</ulink> oder in der mit diesem Handbuch gelieferten Datei COPYING.

source: <application>Referencer</application> Plugin Writing Guide V1.1.6
de: <application>Referencer</application> Plugin-Leitfaden V 1.1.6

source: Referencer is a tool to help you manage your collection of documents, and to use them to generate a bibliography. This guide describes the plugin API of Referencer.
de: Referencer ist ein Werkzeug, das Ihnen bei der Verwaltung Ihrer Dokumentensammlung hilft und aus Ihren Dokumenten eine Bibliografie erstellt. Dieser Leitfaden beschreibt die Plugin-Schnittstelle von Referencer.

source: <application>Referencer</application> Development Team
de: <application>Referencer</application>-Entwicklerteam

source: Referencer Plugin Writing Guide V 1.1.6
de: Referencer Plugin-Leitfaden V 1.1.6

source: This is the Plugin Writing Guide version 1.1.6 of <application>Referencer</application>.
de: Dies ist der Plugin-Leitfaden V 1.1.6 von <application>Referencer</application>.

source: Feedback
de: Rückmeldungen

source: To report a bug or make a suggestion regarding the <application>Referencer</application> application or this manual, please visit the <ulink url="http://icculus.org/referencer" type="help"><application>Referencer</application> home page</ulink>.
de: Um Fehler zu melden oder einen Vorschlag zur Anwendung <application>Referencer</application> oder zu diesem Handbuch zu machen, besuchen Sie bitte die <ulink url="http://icculus.org/referencer" type="help"<application>Referencer</application>-Website</ulink>.

source: Introduction
de: Einführung

source: The <application>Referencer</application> plugin API provides a relatively painless way of adding functionality. Plugins can either add user interface entries to menus and toolbars (action plugins), or provide hooks for downloading metadata for documents (metadata plugins).
de: Die Plugin-Schnittstelle von <application>Referencer</application> stellt einen relativ schmerzlosen Weg zum Hinzufügen neuer Funktionalität bereit. Plugins können entweder weitere Einträge zu Menüs und Werkzeugleisten der Benutzeroberfläche hinzufügen (Aktionen-Plugins) oder Hilfsfunktionen zum Herunterladen von Metadaten für Dokument bereitstellen (Metadaten-Plugins).

source: At the time of writing, the plugin interface is new and not widely tested. Although it is not gratuitously broken there may be issues. You can ask at the <ulink url="http://icculus.org/referencer/contact.html" type="help">mailing list</ulink>.
de: Zum Zeitpunkt der Erstellung dieses Leitfadens ist die Plugin-Schnittstelle noch neu und noch nicht ausreichend getestet. Obwohl nicht völlig unbrauchbar, gibt es doch Schwachstellen. Informieren Sie sich darüber in der <ulink url="http://icculus.org/referencer/contact.html" type="help">Mailingliste</ulink>.

source: This document is written for <application>Referencer</application> v1.1.6.
de: Dieses Dokument bezieht sich auf die Version 1.1.6 von <application>Referencer</application>.

source: Installing Plugins
de: Installieren von Plugins

source: Plugins are python scripts. They don't have to be executable, but they do have to have a filename ending .py. At startup, <application>Referencer</application> searches several locations for plugins: ./plugins, $PREFIX/lib/referencer, and ~/.referencer/plugins.
de: Plugins sind Python-Skripte. Diese müssen nicht ausführbar sein, jedoch ist die Dateiendung .py zwingend notwendig. Beim Start sucht <application>Referencer</application> an verschiedenen Orten nach Plugins: ./plugins, $PREFIX/lib/referencer, und ~/.referencer/plugins.

source: Common API
de: Allgemeine API

source: Plugin info dictionary
de: Informative Beschreibung des Plugins

source: All plugins must contain a dictionary at file scope capped <varname>referencer_plugin_info</varname>. This provides a number of fields describing the plugin. All plugins must provide the following fields, further optional fields are listed in following sections.
de: Alle Plugins müssen eine Beschreibungsdatei im Dateiabschnitt <varname>referencer_plugin_info</varname> enthalten. Diese stellt eine Anzahl von Feldern bereit, die das Plugin beschreiben. Alle Plugins müssen zwingend die folgenden Felder bereitstellen, weitere optionale Felder werden in den folgenden Abschnitten beschrieben.

source: Description
de: Beschreibung

source: Author's name, or comma separated list. eg. "Bob Dole"
de: Name des Autors oder durch Kommata getrennte Liste, z.B. "Hans Schmidt"

source: A version string for the plugin. eg. "1.3.2"
de: Eine Zeichenkette für die Version des Plugins, z.B. "1.3.2"

source: The plugin's purpose. eg. "Format author initials"
de: Der Zweck des Plugins, z.B. "Format author initials"

source: The plugin info structure might be defined like this:
de: Die Struktur der Plugin-Informationen könnte folgendermaßen definiert werden:

source: Utility functions
de: Hilfsfunktionen

source: Import the module <varname>referencer</varname> to access the following functions:
de: Importieren Sie das Modul <varname>referencer</varname>, um auf folgende Funktionen zugreifen zu können:

source: referencer.download(<replaceable>short desc, long desc, url</replaceable>)
de: referencer.download(<replaceable>Kurzbeschreibung, Langbeschreibung, Adresse</replaceable>)

source: Web download convenience function. Returns a string containing the contents of the downloaded file, or an empty string on errors. Example:
de: Funktion zur Vereinfachung von Web-Downloads. Gibt eine Zeichenkette zurück, die den Inhalt der heruntergeladenen Datei enthält, oder eine leere Zeichenkette bei Fehlern. Beispiel:

source: As well as being convenient, this function inherits the user's <application>gnome-vfs</application> proxy settings so is in general preferable where more complex http functionality is not required. In any error case, the function returns an empty string.
de: Um die Einfachheit zu gewährleisten, übernimmt diese Funktion die Proxy-Einstellungen von <application>gnome-vfs</application>, so dass sie bevorzugt werden sollte, falls keine komplexe HTTP-Funktionalität gefordert ist. Im Falle eines Fehlers gibt die Funktion stets eine leere Zeichenkette zurück.

source: Translation function. You probably want to do "from referencer import _" in order to support localisation of user-visible strings. Any user-visible string should be expressed as _("Some text")
de: Übersetzungsfunktion. Um die Übersetzbarkeit aller für den Benutzer sichtbaren Zeichenketten zu gewährleisten, sollten Sie "from referencer import _" benutzen. Jede sichtbare Zeichenkette sollte als _("Etwas Text") ausgedrückt werden.

source: referencer.pref_get(<replaceable>key</replaceable>)
de: referencer.pref_get(<replaceable>Schlüssel</replaceable>)

source: Load a persistent configuration string. If the key is not found an empty string is returned. To avoid conflicting with other plugins, each plugin should use key names prefixed with the name of the plugin. These configuration items are stored in the GConf database along with <application>Referencer</application>'s native configuration.
de: Lädt eine persistente Konfigurationszeichenkette. Falls der Schlüssel nicht gefunden wurde, wird eine leere Zeichenkette zurückgegeben. Um Konflikte mit anderen Plugins zu vermeiden, sollte jedes Plugin Schlüsselnamen verwenden, die den Namen des Plugins als Präfix enthalten. Diese Konfigurationseinträge werden in der GConf-Datenbank zusammen mit der originalen Konfiguration von <application>Referencer</application> gespeichert.

source: referencer.pref_set(<replaceable>key, value</replaceable>)
de: referencer.pref_set(<replaceable>Schlüssel, Wert</replaceable>)

source: Set a persistent configuration string.
de: Setzt eine persistente Konfigurationszeichenkette.

source: <varname>document</varname> class
de: Die <varname>document</varname>-Klasse

source: <application>Referencer</application> exposes individual documents with the document class. This supports a limited number of getter/setter methods:
de: <application>Referencer</application> präsentiert individuelle Dokumente über die document-Klasse. Eine begrenzte Anzahl von Getter/Setter-Methoden werden unterstützt:

source: get_field(<replaceable>key</replaceable>)
de: get_field(<replaceable>Schlüssel</replaceable>)

source: Retrieve a (case-insensitive) field such as "author". Builtin fields are doi, title, volume, number, journal, author, year and pages. Other arbitrarily named fields may or may not exist for a document. Getting a non-existent field returns an empty string.
de: Holt ein Feld wie z.B. »author«. Groß-/Kleinschreibung wird nicht berücksichtigt. Eingebaute Felder sind »doi«, »title«, »volume«, »number«, »journal«, »author«, »year« und »pages«. Weitere Felddefinitionen können, müssen aber für ein Dokument nicht existieren. Das Holen eines nicht existierenden Feldes gibt eine leere Zeichenkette zurück.

source: set_field(<replaceable>key, value</replaceable>)
de: set_field(<replaceable>Schlüssel, Wert</replaceable>)

source: Set a field.
de: Legt ein Feld fest.

source: Get the key of a document. This is the short ID the user would use to reference a document in a latex paper.
de: Holt den Schlüssel des Dokuments. Dies ist die Kennung, die der Benutzer zur Referenzierung eines Dokuments in einem Latex-Dokument verwendet.

source: set_key(<replaceable>value</replaceable>)
de: set_key(<replaceable>Wert</replaceable>)

source: Set the key.
de: Legt den Schlüssel fest.

source: Get the URI (eg "file:///home/me/A_File.pdf") of the file associated with the document.
de: Holt die Adresse (z.B. »file:///home/ich/Eine_Datei.pdf«) der einem Dokument zugeordneten Datei.

source: set_filename(<replaceable>value</replaceable>)
de: set_filename(<replaceable>Wert</replaceable>)

source: Set a document's file URI to <replaceable>value</replaceable>.
de: Setzt die Adresse des Dokuments auf <replaceable>Wert</replaceable>.

source: parse_bibtex(<replaceable>value</replaceable>)
de: parse_bibtex(<replaceable>Wert</replaceable>)

source: Parse value as plain-text BibTex and set the document's fields accordingly.
de: Liest den Wert als Klartext-BibTex ein und füllt die Felder des Dokuments entsprechend aus.

source: Configuration dialog
de: Konfigurationsdialog

source: Plugins can provide a configuration user interface invoked from the preferences dialog. The configuration button in the preferences dialog is enabled if the <varname>referencer_config()</varname> plugin includes a function.
de: Plugins können eine Konfigurationsschnittstelle anbieten, die über den Einstellungsdialog aufgerufen werden kann. Der Konfigurationsknopf im Einstellungsdialog ist aktiviert, wenn das Plugin <varname>referencer_config()</varname> eine Funktion einschließt.

source: Action Plugins
de: Aktionen-Plugins

source: Three things are required to insert actions into the <application>Referencer</application> UI: a description of the action, a string describing location of UI elements, and a function implementing the action.
de: Drei Dinge sind zum Einfügen von Aktionen in die Benutzeroberfläche von <application>Referencer</application> notwendig: eine Beschreibung der Aktion, eine den Ort der Steuerelemente beschreibende Zeichenkette sowie eine Funktion, welche die Aktion implementiert.

source: An action is defined as a dictionary with the following fields:
de: Eine Aktion wird in einer Beschreibung mit den folgenden Feldern definiert:

source: Actions
de: Aktionen

source: Field
de: Feld

source: Long description
de: Ausführliche Beschreibung

source: Filename or stock eg. "foo.png", eg. "_stock:gtk-edit".
de: Dateiname oder Stock-Name, z.B. »foo.png«, oder »_stock:gtk-edit«.

source: Action Function
de: Funktion der Aktion

source: Sensitivity policy function
de: Funktion zur Regelung der Empfindlichkeit

source: Shortcut key, eg "<![CDATA[<control><shift>]]>q"
de: Tastenkürzel, z.B. "<![CDATA[<control><shift>]]>q"

source: An action definition might look like this:
de: Die Definition einer Aktion könnte etwa so aussehen:

source: The plugin should also create a list called <varname>referencer_plugin_actions</varname> containing all actions:
de: Das Plugin sollte auch eine Liste namens <varname>referencer_plugin_actions</varname> erzeugen, die alle Aktionen enthält:

source: To place the actions in the user interface, the field "ui" must be added to the <varname>referencer_plugin_info</varname> dictionary. The ui value is a piece of GtkUIManager XML. This specifies UI elements as children of existing structures such as menus and toolbars. The parent structure is defined as <filename>src/referencer_ui.h</filename> in the <ulink url="http://hg.icculus.org/jcspray/referencer/file/tip/src/referencer_ui.h" type="help"><application>Referencer</application> source code</ulink>. Here's an example of creating menu items in the <guimenu>Document</guimenu> menu and in the toolbar:
de: Um die Aktionen in der Benutzeroberfläche zu platzieren, muss das Feld »ui« zur Beschreibung in <varname>referencer_plugin_info</varname> hinzugefügt werden. Der Wert von »ui« ist ein Stück GtkUIManager-XML. Dies legt Elemente der Benutzerschnittstelle als Kind-Elemente existierender Strukturen wie Menüs oder Werkzeugleisten fest. Die Eltern-Struktur wird als <filename>src/referencer_ui.h</filename> im <ulink url="http://hg.icculus.org/jcspray/referencer/file/tip/src/referencer_ui.h" type="help"><application>Referencer</application>-Quellcode</ulink> definiert. Hier ein Beispiel für die Erzeugung von Menueinträgen im Menü <guimenu>Dokument</guimenu> und in der Werkzeugleiste:

source: The functions referenced as "callback" and "sensitivity" in the action dictionary both have the prototype <varname><replaceable>myfunction</replaceable>(<replaceable>library, documents</replaceable>)</varname> where <replaceable>documents</replaceable> is a list of <varname>referencer.document</varname> and <replaceable>library</replaceable> is a unused. For example: <placeholder-1/>
de: Die als »callback« und »sensitivity« in der Aktionsbeschreibung referenzierten Funktionen haben beide den Prototypen <varname><replaceable>Meine_Funktion</replaceable>(<replaceable>Bibliothek, Dokumente</replaceable>)</varname>, wobei <replaceable>Dokumente</replaceable> eine Liste für <varname>referencer.document</varname> ist und <replaceable>Bibliothek</replaceable> ungenutzt bleibt. Beispiel: <placeholder-1/>

source: Some plugin actions may wish to display arbitrary UI such as dialogs: this can be done using <application>PyGTK</application>. A detailed explanation of <application>PyGTK</application> would be outside the scope of this document: there are many tutorials on writing <application>PyGTK</application> applications. Note that <application>GTK</application> is already initialised by <application>Referencer</application>, so a plugin must not do any <application>GTK</application> initialisation or finalisation. For example, the following code would stand entirely alone:
de: Einige Plugin-Aktionen erfordern die Anzeige zusätzlicher Elemente der Benutzeroberfläche wie beispielsweise Dialoge. Dies kann mittels <application>PyGTK</application> realisiert werden. Eine ausführliche Beschreibung von <application>PyGTK</application> würde den Rahmen dieses Dokuments sprengen. Es gibt zahlreiche Schritt-für-Schritt-Anleitungen zum Schreiben von <application>PyGTK</application>-Anwendungen. Beachten Sie, dass <application>GTK</application> bereits von <application>Referencer</application> initialisiert wird, daher muss sich ein Plugin nicht um die Initialisierung oder Finalisierung von <application>GTK</application> sorgen. Beispielsweise könnte der folgende Code vollständig allein stehen:

source: For an example of an action plugin, have a look at <filename>plugins/genkey.py</filename> in the <ulink url="http://hg.icculus.org/jcspray/referencer/file/tip/plugins/genkey.py" type="http"><application>Referencer</application> source code tree</ulink>.
de: Ein Beispiel eines Aktionen-Plugins finden Sie in der Datei <filename>plugins/genkey.py</filename> im <ulink url="http://hg.icculus.org/jcspray/referencer/file/tip/plugins/genkey.py" type="http"> Quellcode von <application>Referencer</application></ulink>.

source: Metadata Plugins
de: Metadaten-Plugins

source: Metadata plugins provide a function to fill out a document's metadata fields based on a document identifier.
de: Metadaten-Plugins stellen eine Funktion zum Ausfüllen der Metadaten-Felder eines Dokuments bereit, basierend auf dem Bezeichner des Dokuments.

source: To describe which identifier formats are supported, the plugin should create a list of strings called <varname>referencer_plugin_capabilities</varname>. At time of writing, the possible capabilities are "doi", "pubmed" and "arxiv".
de: Um anzugeben, welche Bezeichnerformate unterstützt werden, sollte das Plugin eine Liste von Zeichenketten namens <varname>referencer_plugin_capabilities</varname> erzeugen. Zum Zeitpunkt der Erstellung dieses Leitfadens sind folgende Werte möglich: »doi«, »pubmed« und »arxiv«.

source: To do the lookup, a function <varname>resolve_metadata</varname>(<replaceable>doc, method</replaceable>) should be created. <replaceable>doc</replaceable> is the <varname>referencer.document</varname> whose fields should be filled out, and <replaceable>method</replaceable> is one of the capability strings listed in <varname>referencer_plugin_capabilities</varname>.
de: Um die Suche auszuführen, sollte eine Funktion <varname>resolve_metadata</varname>(<replaceable>Dokument, Methode</replaceable>) erzeugt werden. <replaceable>Dokument</replaceable> ist das <varname>referencer.document</varname>, dessen Felder ausgefüllt werden sollen, und <replaceable>Methode</replaceable> ist eine der in <varname>referencer_plugin_capabilities</varname> aufgelisteten die Fähigkeiten beschreibenden Zeichenketten.

source: For an example of a metadata plugin, have a look at <filename>plugins/pubmed.py</filename> in the <ulink url="http://hg.icculus.org/jcspray/referencer/file/tip/plugins/pubmed.py" type="http"><application>Referencer</application> source code</ulink>.
de: Ein Beispiel eines Metadaten-Plugins finden Sie in der Datei <filename>plugins/pubmed.py</filename> im <ulink url="http://hg.icculus.org/jcspray/referencer/file/tip/plugins/pubmed.py" type="http"> Quellcode von <application>Referencer</application></ulink>.

source: About <application>Referencer</application>
de: Info zu <application>Referencer</application>

source: <application>Referencer</application> and this Plugin Writing guide were written by John Spray (<email>jcspray@icculus.org</email>). Some contributions to this guide came from Mario Blättermann (<email>mariobl@gnome.org</email>. To find more information about <application>Referencer</application> and the most recent documentation, please visit the <ulink url="http://icculus.org/referencer" type="http">project page</ulink>.
de: <application>Referencer</application> und dieser Plugin-Leifaden wurden von John Spray (<email>jcspray@icculus.org</email>) geschrieben. Einige Beiträge zu diesem Handbuch kamen von Mario Blättermann (<email>mariobl@gnome.org</email>. Weitere Informationen über <application>Referencer</application> sowie die aktuellste Dokumentation finden Sie auf der <ulink url="http://icculus.org/referencer" type="http">Projekt-Website</ulink>.

source: This program is distributed under the terms of the GNU General Public license as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. A <ulink url="ghelp:gpl" type="help">copy of this license</ulink> is included with this documentation; another can be found in the file COPYING included with the source code of this program.
de: Dieses Programm ist freie Software. Sie können es unter den Bedingungen der <citetitle>GNU General Public License</citetitle>, wie von der Free Software Foundation veröffentlicht, weitergeben und/oder modifizieren, entweder gemäß Version 2 der Lizenz oder (nach Ihrer Option) jeder späteren Version. Eine <ulink url="ghelp:gpl" type="help">Kopie dieser Lizenz</ulink> ist in dieser Dokumentation enthalten, eine weitere in der Datei COPYING, die im Quellcode dieses Programms enthalten ist.

source: translator-credits
de: Mario Blättermann <mariobl@gnome.org>, 2009
