Repository: mcraveiro/referencer
Catalog: help/*/*.po
Languages: de

source: @@image: 'figures/referencer_window.png'; md5=f74411d3c605160d5a38b5db1e3b7281
de: translated

source: <application>Referencer</application> Manual V1.1.6
de: <application>Referencer</application>-Handbuch V1.1.6

source: Referencer is a tool to help you manage your collection of documents, and to use them to generate a bibliography.
de: Referencer ist ein Werkzeug, das Ihnen bei der Verwaltung Ihrer Dokumentensammlung hilft und aus Ihren Dokumenten eine Bibliografie erstellt.

source: Referencer Development Team
de: Referencer-Entwickler-Team

source: Referencer Manual V 1.1.6
de: Referencer-Handbuch V 1.1.6

source: This manual describes version 1.1.6 of <application>Referencer</application>.
de: Dieses Handbuch beschreibt Version 1.1.6 von <application>Referencer</application>.

source: Feedback
de: Rückmeldungen

source: To report a bug or make a suggestion regarding the <application>Referencer</application> application or this manual, please visit the <ulink url="http://icculus.org/referencer" type="help">Referencer home page</ulink>.
de: Um Fehler zu melden oder einen Vorschlag zur Anwendung <application>Referencer</application> oder zu diesem Handbuch zu machen, besuchen Sie bitte die <ulink url="http://icculus.org/referencer" type="help">Referencer-Website</ulink>.

source: Introduction
de: Einführung

source: <application>Referencer</application> is a tool to help you manage your collection of documents, and to use them to generate a bibliography. It is designed with the scientist/researcher in mind, and "document" may be taken to mean "paper" in general, although <application>Referencer</application> can deal with any kind of document that BibTeX can.
de: <application>Referencer</application> ist ein Werkzeug, das Ihnen bei der Verwaltung Ihrer Dokumentensammlung hilft und aus Ihren Dokumenten eine Bibliografie erstellt. Es wurde für die Anforderungen des Wissenschaftlers und Forschers entwickelt, wobei »Dokument« sich auf »Papier« im Allgemeinen bezieht, obgleich <application>Referencer</application> mit allen von BibTex verarbeitbaren Dokumenten umgehen kann.

source: Getting Started
de: Erste Schritte

source: Starting <application>Referencer</application>
de: <application>Referencer</application> starten

source: You can start <application>Referencer</application> in the following ways:
de: Sie können <application>Referencer</application> auf folgende Arten starten:

source: <guimenu>Applications</guimenu> menu
de: Menü <guimenu>Anwendungen</guimenu>

source: Choose <menuchoice><guisubmenu>Office</guisubmenu><guimenuitem>Referencer</guimenuitem></menuchoice>.
de: Wählen Sie <menuchoice><guisubmenu>Büroanwendungen</guisubmenu><guimenuitem>Referencer</guimenuitem></menuchoice>.

source: Command line
de: Befehlszeile

source: To start <application>Referencer</application> from a command line, type the following command, then press <keycap>Return</keycap>:
de: Um <application>Referencer</application> aus einer Befehlszeile zu starten, geben Sie folgenden Befehl ein und drücken dann die <keycap>Eingabetaste</keycap>:

source: When You Start <application>Referencer</application>
de: Beim Start von <application>Referencer</application>

source: When you start <application>Referencer</application>, the following window is displayed.
de: Wenn Sie <application>Referencer</application> starten, wird folgendes Fenster angezeigt.

source: <application>Referencer</application> Start Up Window
de: <application>Referencer</application>-Startfenster

source: Shows <application>Referencer</application> main window.
de: Zeigt das Startfenster von <application>Referencer</application>.

source: The <application>Referencer</application> window contains the following elements:
de: Das <application>Referencer</application>-Fenster enthält folgende Elemente:

source: Menubar
de: Menüleiste

source: The menus on the menubar contain all of the commands that you need to work with files in <application>Referencer</application>.
de: Die Menüs in der Menüleiste enthalten alle Befehle, die Sie zum Arbeiten mit Dateien in <application>Referencer</application> benötigen.

source: Toolbar
de: Werkzeugleiste

source: The toolbar provides quick access to some frequently used menu items.
de: Die Werkzeugleiste ermöglicht Ihnen den schnellen Zugriff auf häufig benutzte Menüeinträge.

source: Document list
de: Dokumentenliste

source: The document list shows the documents in the library being worked on. It can be used in either <guimenuitem>List View</guimenuitem> or <guimenuitem>Icon View</guimenuitem>.
de: Die Dokumentenliste zeigt eine Liste der Dokumente der Bibliothek an, in welcher Sie gegenwärtig arbeiten. Die Anzeige ist entweder in der <guimenuitem>Listenansicht</guimenuitem> oder in der <guimenuitem>Symbolansicht</guimenuitem> möglich.

source: Tag pane
de: Markenleiste

source: The tag pane provides a list of tags which can be applied to documents, as well as buttons for creatings and deleting tags. The document list can be filtered to certain tags by selecting them in the tag pane.
de: Die Markenleiste stellt eine Liste von Marken bereit, die zu Dokumenten hinzugefügt werden können, und zwar in Form von Knöpfen zum Hinzufügen und Entfernen von Marken. Die Dokumentenliste kann anhand bestimmter Marken gefiltert werden, indem Sie die entsprechenden Marken in der Markenleiste auswählen.

source: Usage
de: Benutzung

source: At it's most basic, <application>Referencer</application> may be used for editing your documents and bibliography data (library). However, it also includes useful time-saving features. Chief amongst these is the automatic acquisition of bibliographic information (metadata) for some kinds of document.
de: Das grundlegende Anwendungsgebiet von <application>Referencer</application> ist das Bearbeiten von Dokumenten und bibliografischen Daten (Bibliotheken). Allerdings bietet die Anwendung auch einige zeitsparende Funktionen. Die wichtigste davon ist das automatische Ergänzen bibliografischer Informationen (Metadaten) für einige Dokumenttypen.

source: When you add a PDF file to your <application>Referencer</application> library, it will automatically be searched for key identifiers such as a DOI code or arXiv identifier. If either of these is found, <application>Referencer</application> uses your internet connection to retrieve the metadata for the document.
de: Wenn Sie eine PDF-Datei zu Ihrer <application>Referencer</application>-Bibliothek hinzufügen, wird diese Datei automatisch nach Schlüsseln wie dem DOI-Code oder arXiv-Kennungen durchsucht. Falls eines davon gefunden wird, benutzt <application>Referencer</application> Ihre Internetverbindung, um die Metadaten für dieses Dokument zu holen.

source: If you've got a collection of already-downloaded PDFs of papers, this can save you a lot of typing!
de: Falls Sie bereits über eine Sammlung bereits heruntergeladener PDF-Dateien oder Papiere verfügen, erspart Ihnen dies eine Menge Tipparbeit!

source: <application>Referencer</application> also uses its knowledge of papers to provide handy functions such as opening the web page associated with the article, or opening the document itself. Additionally, you can attach tags to documents to catgorise them, and then browse documents more easily by filtering them by tag.
de: <application>Referencer</application> benutzt auch seine Kenntnisse im Umgang mit Papieren zur Bereitstellung praktischer Funktionen wie dem Öffnen einer mit dem Artikel verbundenen Website, oder dem Öffnen des Dokuments selbst. Zusätzlich können Sie zur Kategorisierung der Dokumente Marken hinzufügen. Dadurch lässt sich die Dokumentenbibliothek leichter durchsuchen, indem sie anhand der Marken gefiltert wird.

source: <application>Referencer</application> is intended to be extremely user-friendly, but to help you get up and running as smoothly as possible, the following subsections explain how to use <application>Referencer</application>.
de: <application>Referencer</application> ist extrem benutzerfreundlich angelegt, aber um Ihnen den Einstieg so unkompliziert wie möglich zu gestalten, beschreiben die folgenden Unterabschnitte, wie Sie <application>Referencer</application> benutzen.

source: To use <application>Referencer</application> with BibTex
de: Verwendung von <application>Referencer</application> mit BibTex

source: <application>Referencer</application> maintains its own library of your documents, rather than loading and editing a BibTeX file. As such, when you're ready to use your library in your LaTeX document, you can have <application>Referencer</application> generate a BibTeX file (by choosing <menuchoice><guisubmenu>Library</guisubmenu><guimenuitem>Export to BibTex</guimenuitem></menuchoice>). By default this will include all documents in your library: if you would rather only export some documents then you can use the <guilabel>Selection:</guilabel> field in the export dialog to restrict the export to certain documents. Rather than repeatedly exporting when you make changes, you can tell <application>Referencer</application> to write the BibTeX file every time you change your library (<menuchoice><guisubmenu>Library</guisubmenu><guimenuitem>Manage BibTex File</guimenuitem></menuchoice>).
de: <application>Referencer</application> lädt nicht nur BibTex-Dateien und bearbeitet diese, sondern verwaltet seine eigene Dokumentenbibliothek. Wenn Sie Ihre Bibliothek in einem LaTex-Dokument verwenden wollen, können Sie durch <application>Referencer</application> eine BibTex-Datei erzeugen lassen. Wählen Sie hierzu <menuchoice><guisubmenu>Bibliothek</guisubmenu><guimenuitem>BibTex exportieren</guimenuitem></menuchoice>. Standardmäßig schließt dies alle Dokumente in Ihrer Bibliothek ein. Falls Sie nur einige Dokumente exportieren wollen, können Sie das Feld <guilabel>Auswahl:</guilabel> im Exportdialog verwenden, um den Export auf bestimmte Dokumente zu beschränken. Um immer wiederkehrendes Exportieren nach Änderungen zu vermeiden, können Sie <application>Referencer</application> anweisen, nach jeder Änderung die BibTex-Datei neu zu speichern. Wählen Sie hierzu <menuchoice><guisubmenu>Bibliothek</guisubmenu><guimenuitem>BibTex-Datei verwalten</guimenuitem></menuchoice>

source: <application>Referencer</application> will automatically handle conversion of special characters (e.g. <literal>ß</literal>) to their <application>LaTex</application> equivalents (e.g. <literal>\ss</literal>). Depending on the BibTeX style you are using in your work, capitalization of text in your LaTex output may differ from that in your <application>Referencer</application> library. This is to allow publishers to impose their own capitalization schemes. If you want text to be capitalized in your work exactly as it is in your library, then you can use the <guilabel>Protect capitalization</guilabel> option in the BibTeX export dialog.
de: <application>Referencer</application> wandelt automatisch spezielle Zeichen (z.B. <literal>ß</literal>) in die <application>LaTex</application>-Entsprechungen um (im genannten Fall <literal>\ss</literal>). Abhängig von dem in Ihren Arbeiten verwendeten BibTex-Stil könnte sich die Großschreibung im Text der LaTex-Ausgabe von der in Ihrer <application>Referencer</application>-Bibliothek unterscheiden, weil das den Veröffentlichern ermöglicht, ihre eigenen Großschreibungs-Schemen durchzusetzen. Falls Sie die Großschreibung in Ihren Arbeiten exakt so erhalten möchten wie in Ihrer Bibliothek, dann können Sie dazu die Option <guilabel>Großschreibung schützen</guilabel> im BibTex-Exportdialog verwenden.

source: If you already have a BibTeX file, you can import it into <application>Referencer</application> by choosing <menuchoice><guisubmenu>Library</guisubmenu><guimenuitem>Import...</guimenuitem></menuchoice> from the menubar.
de: Falls sie bereits über eine BibTex-Datei verfügen, können Sie diese durch <application>Referencer</application> importieren lassen. Wählen Sie <menuchoice><guisubmenu>Bibliothek</guisubmenu><guimenuitem>Importieren...</guimenuitem></menuchoice> aus der Menüleiste.

source: Importing and then exporting a BibTex file is not guaranteed (or intended) to produce exactly the same file as went in: <application>Referencer</application> is not a BibTeX editor!
de: Das Importieren und anschließende Exportieren als BibTex-Datei garantiert (oder beabsichtigt) nicht, dass Sie exakt die gleiche Datei erhalten wie vor dem Import: <application>Referencer</application> ist kein BibTex-Editor!

source: Information such as document filenames and tags is not included in BibTeX files. You should always use your <application>Referencer</application> library file as the authoritative copy.
de: Informationen wie die Dateinamen der Dokumente und die Markierungen sind in den BibTex-Dateien nicht enthalten. Sie sollten stets Ihre <application>Referencer</application>-Bibliotheksdatei als maßgebende Kopie verwenden.

source: To add documents
de: Hinzufügen von Dokumenten

source: To add documents by file/folder
de: Hinzufügen von Dokumenten nach Datei oder Ordner

source: Choose <menuchoice><guisubmenu>Documents</guisubmenu><guimenuitem>Add file …</guimenuitem></menuchoice> from the menubar.
de: Wählen Sie <menuchoice><guisubmenu>Dokumente</guisubmenu><guimenuitem>Datei hinzufügen…</guimenuitem></menuchoice> aus der Menüleiste.

source: If you have some document files you'd like Referencer to know about, you can add one or more files, or a whole folder (by choosing <menuchoice><guisubmenu>Documents</guisubmenu><guimenuitem>Add folder …</guimenuitem></menuchoice>), and <application>Referencer</application> will create entries for each file. PDF files will be read, and <application>Referencer</application> will do its best to fill out the metadata for you.
de: Falls Sie Referencer über vorhandene Dokumentdateien in Kenntnis setzen wollen, können Sie eine oder mehrere Dateien oder auch einen ganzen Ordner hinzufügen. Wählen Sie <menuchoice><guisubmenu>Dokumente</guisubmenu><guimenuitem>Ordner hinzufügen …</guimenuitem></menuchoice>, und <application>Referencer</application> erstellt Einträge für jede Datei. PDF-Dateien werden gelesen, und <application>Referencer</application> tut sein bestes, um die Metadaten für Sie hinzuzufügen.

source: When adding a folder of files, files named ".svn", "CVS", files with the extension ".bib" or ".reflib" and files with names starting "." are automatically skipped. These files can still be added individually.
de: Wenn Sie einen Ordner oder Dateien hinzufügen, werden Objekte namens ».svn«, »CVS«, Dateien mit den Erweiterungen ».bib« oder ».reflib» sowie Dateien, deren Namen mit ».« beginnen, automatisch übersprungen. Diese Dateien können jedoch individuell hinzugefügt werden.

source: To add documents by DOI code
de: Hinzufügen von Dokumenten anhand des DOI-Codes

source: Choose <menuchoice><guisubmenu>Documents</guisubmenu><guimenuitem>Add document with DOI …</guimenuitem></menuchoice> from the menubar.
de: Wählen Sie <menuchoice><guisubmenu>Dokumente</guisubmenu><guimenuitem>Dokument mit DOI hinzufügen…</guimenuitem></menuchoice> aus der Menüleiste.

source: If you have the DOI code for a paper, you can save yourself the effort of inputting its metadata by simply giving <application>Referencer</application> the DOI and letting it look up the metadata for you.
de: Falls Sie über den DOI-Code für ein Papier verfügen, können Sie sich die Mühe der Eingabe der Metadaten ersparen, indem Sie <application>Referencer</application> anhand des DOI-Codes für Sie nach den Metadaten suchen lassen.

source: To add documents by hand
de: Manuelles Hinzufügen von Dokumenten

source: Choose <menuchoice><guisubmenu>Documents</guisubmenu><guimenuitem>Add empty reference …</guimenuitem></menuchoice> from the menubar.
de: Wählen Sie <menuchoice><guisubmenu>Dokumente</guisubmenu><guimenuitem>Leere Referenz hinzufügen…</guimenuitem></menuchoice> aus der Menüleiste.

source: As a last resort, <application>Referencer</application> provides a simple interface for manually creating a document and inputting metadata. A document with no information is created, and the properties window is opened for you to enter a name for the document and some metadata.
de: Nicht zuletzt stellt <application>Referencer</application> auch eine einfache Oberfläche für das manuelle Erzeugen eines Dokuments und die Eingabe der Metadaten bereit. Ein Dokument ohne Informationen wird erzeugt und ein Eigenschaftsdialog geöffnet, in dem Sie einen Namen für das Dokument und einige Metadaten eingeben können.

source: To add documents from a BibTeX/EndNote/Refer file
de: Hinzufügen von Dokumenten aus einer BibTeX/EndNote/Refer-Datei

source: Choose <menuchoice><guisubmenu>Library</guisubmenu><guimenuitem>Import …</guimenuitem></menuchoice> from the menubar.
de: Wählen Sie <menuchoice><guisubmenu>Bibliothek</guisubmenu><guimenuitem>Importieren…</guimenuitem></menuchoice> aus der Menüleiste.

source: Your existing bibliography files, or snippets from websites can be imported. Items from these files will be loaded and added to the currently open library.
de: Ihre vorhandenen Bibliografie-Dateien und auch Schnipsel aus Websites können importiert werden. Die Objekte aus solchen Dateien werden geladen und zur gegenwärtig geöffneten Bibliothek hinzugefügt.

source: To add documents by Copy/Paste
de: Hinzufügen von Dokumenten mittels Kopieren und Einfügen

source: To conveniently import references from the web, or particular references from an existing BibTeX file, you can simply copy and past BibTeX markup into referencer, where these references will be added as if you had imported them from a file.
de: Um bequem Referenzen aus dem Web oder Referenzen aus einer vorhandenen BibTex-Datei zu importieren, können Sie diese einfach kopieren und in Referencer einfügen. Diese Referenzen werden auf die gleiche Weise hinzugefügt, als wären sie aus einer Datei importiert worden.

source: Choose <menuchoice><guisubmenu>Edit</guisubmenu><guimenuitem>Paste BibTex</guimenuitem></menuchoice> from the menubar. <placeholder-1/>
de: Wählen Sie <menuchoice><guisubmenu>Bearbeiten</guisubmenu><guimenuitem>BibTex einfügen</guimenuitem></menuchoice> aus der Menüleiste. <placeholder-1/>

source: To use different document types/fields
de: Verwendung verschiedener Dokumenttypen und -felder

source: <application>Referencer's</application> user interface is optimized for dealing with scientific papers. As such, the document type is "Article" by default and fields such as <guilabel>Title</guilabel>, <guilabel>Authors</guilabel>, <guilabel>Journal</guilabel> and <guilabel>Volume</guilabel> are shown. Other types of document may be selected in the properties window. To open this, choose <menuchoice><guisubmenu>Documents</guisubmenu><guimenuitem>Properties</guimenuitem></menuchoice> from the menubar.
de: Die Benutzeroberfläche von <application>Referencer</application> ist für den Umgang mit wissenschaftlichen Papieren optimiert. Daher ist der vorgegebene Dokumenttyp »Article« und Felder wie <guilabel>Title</guilabel>, <guilabel>Authors</guilabel>, <guilabel>Journal</guilabel> und <guilabel>Volume</guilabel> werden angezeigt. Andere Dokumenttypen können im Eigenschaftsdialog gewählt werden. Um diesen zu öffnen, wählen Sie <menuchoice><guisubmenu>Dokumente</guisubmenu><guimenuitem>Eigenschaften</guimenuitem></menuchoice> aus der Menüleiste.

source: If you don't see the BibTeX type you want, simply type it in and it will be passed through verbatim when exporting to your BibTeX file. Some document types may require additional metadata fields, for example "Book" documents should have an "Editor" field. You can add this by expanding the <guilabel>Extra Fields</guilabel> section of the properties window, and clicking the <guilabel>New</guilabel> icon. To enter some data into your new field, select it and click the <guilabel>Edit</guilabel> icon.
de: Falls nicht der von Ihnen gewünschte BibTex-Typ angezeigt wird, geben Sie ihn einfach ein und er wird unverändert beim Exportieren Ihrer BibTex-Datei übernommen. Einige Dokumenttypen erfordern zusätzliche Metadatenfelder, beispielsweise sollten »Book«-Dokumente über ein »Editor«-Feld verfügen. Diese können Sie durch Ausklappen des Abschnitts <guilabel>Zusätzliche Felder</guilabel> im Eigenschaftsdialog und Anklicken des Symbols <guilabel>Neu</guilabel> hinzufügen. Um Daten in das neue Feld einzugeben, wählen Sie es aus und klicken Sie auf das Symbol <guilabel>Bearbeiten</guilabel>.

source: Tagging And Searching
de: Markieren und Suchen

source: Tagging allows you to categorize your documents. Unlike a traditional hierarchical directory type organisation, a tag-based system allows a document to belong to multiple overlapping categories. For instance, you might have tags called "Physics" and "Biology", and another called "Exciting papers". If these were directories, you would have to make arbitrary choices about which to put a paper into. As it is, you can just assign both "Physics" and "Exciting papers" to a document, and when you're not excited any more just remove the "Exciting papers" tag.
de: Das Markieren ermöglicht Ihnen die Kategorisierung Ihrer Dokumente. Im Gegensatz zur traditionellen hierarchischen Ordnerstruktur erlaubt ein auf Markierungen basierendes System, ein Dokument mehreren einander überlappenden Kategorien zuzuordnen. Beispielsweise verfügen Sie über Marken wie »Physik« und »Biologie« sowie eine weitere namens »Wichtige Papiere«. Falls es sich dabei um Ordner handelt, müssen Sie willkürlich festlegen, wo Sie ein Papier einordnen wollen. Hier jedoch können Sie sowohl »Physik« als auch »Wichtige Papiere« verwenden, und wenn die Wichtigkeit nicht mehr gegeben ist, dann entfernen Sie einfach die Marke »Wichtige Papiere«.

source: Once you've created a tag (by choosing <menuchoice><guisubmenu>Tags</guisubmenu><guimenuitem>Create Tag …</guimenuitem></menuchoice>), a checkbox for the tag will appear in the bottom half of the Tag Pane (shown or hidden using <menuchoice><guisubmenu>View</guisubmenu><guimenuitem>Show Tag Pane</guimenuitem></menuchoice>). Once you've selected one or more documents, you can set or unset this tag for the group by clicking the checkbox.
de: Sobald Sie durch <menuchoice><guisubmenu>Marken</guisubmenu><guimenuitem>Marke erzeugen …</guimenuitem></menuchoice> eine Marke erzeugt haben, erscheint in der unteren Hälfte der Markenleiste ein Kontrollkästchen. Die Markenleiste können Sie aktivieren oder deaktivieren, indem Sie die Option <menuchoice><guisubmenu>Ansicht</guisubmenu><guimenuitem>Markenleiste anzeigen</guimenuitem></menuchoice> wählen. Nach der Auswahl eines oder mehrerer Dokumente setzen oder entfernen Sie eine Marke, indem Sie in das Kontrollkästchen klicken.

source: Once you've tagged some documents, you may want to filter your view by tag. You can do this by clicking on a tag in the list in the top half of the Tag Pane. To include more tags in the view, hold <keycap>Ctrl</keycap> while clicking to select more than one tag.
de: Wenn Sie einige Dokumente markiert haben, möchten Sie vielleicht die Ansicht nach Marken filtern. Klicken Sie dazu auf eine Marke in der Liste in der oberen Hälfte der Markenleiste. Um mehrere Marken auszuwählen, halten Sie dazu die <keycap>Strg</keycap>-Taste gedrückt.
