Repository: mcraveiro/referencer
Catalog: help/*/*.po
Languages: de

source: To complement the tagging system, a search box is provided above the document view. Entering text into the search box will cause only those documents featuring the search text to be shown. The search only considers the <guilabel>Title</guilabel>, <guilabel>Authors</guilabel> and <guilabel>Key</guilabel> fields of the documents.
de: Als Ergänzung des Marken-Systems wird oberhalb der Dokumentenansicht ein Suchfeld angezeigt. Wenn Sie hier Text eingeben, werden nur Dokumente angezeigt, die diesen Text enthalten. Die Suche berücksichtigt nur die Felder <guilabel>Title</guilabel>, <guilabel>Authors</guilabel> und <guilabel>Key</guilabel> des Dokuments.

source: Additional functionality can be added to <application>Referencer</application> using the versatile <ulink url="http://www.python.org" type="http">Python</ulink> language. As of version 1.1, two kinds of plugin are supported: <application>Metadata fetcher</application> plugins, and <application>Document action</application> plugins. The former might be a script that looks up metadata for a DOI code in an internet database, while the latter might be something that manipulates the metadata of an existing document in some way.
de: Zusätzliche Funktionalität kann <application>Referencer</application> mit Hilfe der vielseitigen Skriptsprache <ulink url="http://www.python.org" type="http">Python</ulink> verliehen werden. Seit Version 1.1 werden zwei Arten von Plugins unterstützt: <application>Metadata fetcher</application>-Plugins und <application>Document action</application>-Plugins. Das erstere ist ein Skript, das nach Metadaten des DOI-Codes in einer Internet-Datenbank sucht, das letztere dient zur Bearbeitung der Metadaten eines vorhandenen Dokuments auf verschiedene Weise.

source: Interested developers should download the <application>Referencer</application> source code and look in the plugins/ directory for examples and in plugins/README for a brief guide.
de: Interessierte Entwickler sollten den <application>Referencer</application>-Quellcode herunterladen. Im Ordner plugins/ befinden sich Beispiele sowie in plugins/README eine Kurzanleitung.

source: About <application>Referencer</application>
de: Info zu <application>Referencer</application>

source: <application>Referencer</application> and this manual were written by John Spray (<email>jcspray@icculus.org</email>). Some contributions to the manual came from Mario Blättermann (<email>mario.blaettermann@t-online.de</email>. To find more information about <application>Referencer</application> and the most recent documentation, please visit the <ulink url="http://icculus.org/referencer" type="http">project page</ulink>.
de: <application>Referencer</application> und dieses Handbuch wurden von John Spray (<email>jcspray@icculus.org</email>) geschrieben. Einige Beiträge zu diesem Handbuch kamen von Mario Blättermann (<email>mario.blaettermann@t-online.de</email>. Weitere Informationen über <application>Referencer</application> sowie die aktuellste Dokumentation finden Sie auf der <ulink url="http://icculus.org/referencer" type="http">Projekt-Website</ulink>.

source: This program is distributed under the terms of the GNU General Public license as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. A <ulink url="ghelp:gpl" type="help">copy of this license</ulink> is included with this documentation; another can be found in the file COPYING included with the source code of this program.
de: Dieses Programm ist freie Software. Sie können es unter den Bedingungen der <citetitle>GNU General Public License</citetitle>, wie von der Free Software Foundation veröffentlicht, weitergeben und/oder modifizieren, entweder gemäß Version 2 der Lizenz oder (nach Ihrer Option) jeder späteren Version. Eine <ulink url="ghelp:gpl" type="help">Kopie dieser Lizenz</ulink> ist in dieser Dokumentation enthalten, eine weitere in der Datei COPYING, die im Quellcode dieses Programms enthalten ist.

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU General Public License Version 2. You can find a copy of the GPL at this <ulink type="help" url="ghelp:gpl">link</ulink> or in the file COPYING distributed with this manual.
de: Das vorliegende Dokument kann gemäß den Bedingungen der GNU General Public License (GPL), Version 2 kopiert, verteilt und/oder modifiziert werden. Eine Kopie der GPL finden Sie unter diesem <ulink type="help" url="ghelp:gpl">Link</ulink> oder in der mit diesem Handbuch gelieferten Datei COPYING.

source: translator-credits
de: Mario Blättermann <mariobl@gnome.org>, 2008
