Repository: mcraveiro/referencer
Catalog: po/*.po
Languages: nb

source: <b>Document</b>
nb: <b>Dokument</b>

source: <b>E_xtra Fields</b>
nb: <b>E_kstra Felt</b>

source: Add a field
nb: Legg til et felt

source: Attempt to look up metadata for this document online
nb: Forsøk å slå opp metadata for dette dokumentet på-nett

source: Clear metadata
nb: Rydd metadata

source: Delete this field
nb: slett dette feltet

source: Document Properties
nb: Dokument Egenskaper

source: Fill out metadata from BibTeX on clipboard
nb: Fyll ut metadata fr BibTeX på utklippstavlen

source: Rename this field
nb: Endre dette feltnavnet

source: Select A File
nb: Velg en fil

source: _Key:
nb: _Nøkkel:

source: <b>Proxy</b>
nb: <b>Fullmakt</b>

source: C_onfigure...
nb: K_onfiguer...

source: Host:
nb: Vert:

source: Move _down
nb: Flytt _ned

source: Network
nb: Nettverk

source: Password:
nb: Passord:

source: Plugins
nb: Tillegg

source: Preferences
nb: Alternativer:

source: Use authentication
nb: Benytt autentisering

source: Use web proxy
nb: Use web fullmakt (proxy)

source: PubMed DOI resolver
nb: PubMed DOU oppløs

source: Resolving DOI
nb: Oppløsning DOI

source: Finding PubMed ID from DOI %s
nb: Søking PubMed ID fra DOI %s

source: Resolving PubMed ID
nb: Oppløsning PubMed ID

source: Retrieving metadata
nb: Gjenfinner metadata

source: Contacting citebase.org to retrieve metadata for '%1'
nb: Kontakt citebase.org til å gjenfinne metadata for '%1'

source: Downloading Metadata
nb: Laster ned Metadata

source: Downloading metadata
nb: Laster ned metadata

source: Parsing BibTeX
nb: Analyserer BibTex

source: _Preferences
nb: _Brukervalg

source: _Disable CrossRef
nb: _Deaktiver CrossRef

source: Unnamed
nb: Uten navn

source: Moving '%1' to '%2'
nb: Flytter '%1' til '%2'

source: Opening file '%1'
nb: Åpner fil '%1'

source: Reading file '%1'
nb: Leser fil '%1'

source: converting file %1 to utf8 from (guessed) latin1
nb: Konverterer fil %1 til utf8 fra (gjettet) latin1

source: Extracting document %1 from bibutils structure
nb: Pakker ut dokument %1 fra bibutils struktur

source: No references found on clipboard.
nb: Ingen referanser funnet på utklippstavlen.

source: Multiple references found on clipboard.
nb: Flerfoldige referanser funnet på utklippstavlen.

source: Title
nb: Tittel

source: Authors
nb: Forfattere

source: Year
nb: År

source: Issue
nb: Utgivelse

source: Pages
nb: Sider

source: Month
nb: Måned

source: Organisation
nb: Organisasjon

source: How published
nb: Hvordan publisere

source: In Proceedings
nb: I Forhandlinger

source: Misc
nb: Forskjellig

source: PhD thesis
nb: PhD avhandling

source: Proceedings
nb: Forhandlinger

source: In Book
nb: I Bok

source: Technical Report
nb: Teknisk Rapport

source: Downloaded Documents
nb: Lastet ned Dokumenter

source: Getting info for file '%1'
nb: Få informasjon for fil '%1'

source: Opening %1
nb: Åpner %1

source: Document location ambiguity
nb: Dokuments lokasjons tvetydighet

source: The file '%1' exists in two locations: Original: <b>%2</b> New: <b>%3</b> Do you want to keep the original location, or update it to the new one?
nb: Filen '%1' eksisterer i to lokasjoner: Original: <b>%2</b> Ny: <b>%3</b> Vil du beholde original filen eller oppdatere den til Ny?

source: Keep _Original
nb: Behold _Original

source: Use _New
nb: Bruk _Ny

source: '%s' is not a valid boolean value
nb: '%s' er ikke en gyldig boolean verdi

source: Enabled
nb: Aktivert

source: Plugin error
nb: Programtillegg feil

source: Exception
nb: Unntak

source: _Library
nb: _Bibliotek

source: _Open...
nb: _Åpne

source: E_xport as BibTeX...
nb: E_ksporter som BibTeX...

source: _Manage BibTeX File...
nb: _Behandle BibTeX Fil...

source: _Import...
nb: _Importer ...

source: _Work Offline
nb: _Arbeid frakoblet

source: _Edit
nb: _Redigér

source: _View
nb: _Visning

source: Import references from BibTeX on the clipboard
nb: Import referanser fra BibTeX på utklippstavlen

source: _Copy LaTeX citation
nb: _Kopier LaTeX sitat

source: Copy currently selected keys to the clipboard as a LaTeX citation
nb: Kopier valgte nøkler til utklippstavlen som LaTeX sitat

source: Use _List View
nb: Bruk _Liste Vis

source: Use _Icon View
nb: Bruk _Ikon Vis

source: _Show Tag Pane
nb: Vi_s Merke Rute

source: Show _Notes Pane
nb: Vis Rute _Notater

source: _Tags
nb: _Merker

source: _Create Tag...
nb: _Lag Merker...

source: _Delete Tag
nb: _Slett Merke

source: _Rename Tag
nb: End_re Merke Navn

source: _Documents
nb: _Dokumenter

source: _Add File...
nb: Legg til Fil...

source: Add _Folder...
nb: Legg til _Mappe...

source: Add E_mpty Reference...
nb: Legg til To_m Referanser...

source: Add Refere_nce with ID...
nb: Leg till Refera_nser med ID...

source: _Get Metadata
nb: _Hent Metadata

source: R_ename File from Key
nb: Endr_e Fil fra Nøkkel

source: Export Notes as HTML
nb: Eksporter Notater som HTML

source: _Help
nb: _Hjelp

source: Introduction
nb: Introduksjon

source: All
nb: Alt

source: Untagged
nb: Umerket

source: %1 documents
nb: %1 dokument

source: _Notes: <i>%1</i>
nb: _Notater: <i>%1</i>

source: Select a document to view and edit notes
nb: Velg et dokument til å vise og rediger notater

source: Save changes to library before closing?
nb: Lagre endringer til bibliotek før lukking

source: Type a tag
nb: Skriv et merke

source: Create tag
nb: Lag merke

source: Short memorable tag names help you organise your documents
nb: Kort og uforglemmelig merkenavn hjelper deg å organisere dine dokumenter

source: Are you sure you want to delete "%1"?
nb: Er du sikker at du vil slette "%1"?

source: Export BibTeX
nb: Eksport BibTeX

source: BibTeX Files
nb: BibTeX Filer

source: All Files
nb: Alle Filer

source: Selection:
nb: Merking:

source: All Documents
nb: Alle dokumenter

source: Selected Documents
nb: Ut ValgteDokumenter

source: Protect capitalization (surround values with {})
nb: Beskytt skriving med store bokstaver (omgi verdier med { })

source: Use Unicode (UTF-8) encoding
nb: Bruke Unicode (UTF8) encoding

source: Export Notes
nb: Eksporter Notater

source: HTML Files
nb: HTML Filer

source: Unnamed Library
nb: Navløs Bibliotek

source: Browse
nb: Bla igjennom

source: Manage BibTeX File
nb: Behandl BibTeX Fil

source: If you choose a file here, it will be overwritten whenever this library is saved.
nb: Hvis du velge en fil her, den vil overskrives uansett når dette biblioteket er lagret.

source: BibTeX file:
nb: BibTeX fil:

source: Open Library
nb: Åpne Bibliotek

source: Referencer Libraries
nb: Henviser til Biblioteker

source: Save Library As
nb: Lagre Bibliotek Som

source: translator-credits
nb: Launchpad Contributions: Akselsen Rune https://launchpad.net/~runeakselsen Daniel Høyer Iversen https://launchpad.net/~dahoiv

source: Showing '%1'
nb: Visning '%1'

source: Cancelling
nb: Kansellering

source: C_reate Tag...
nb: L_ag Merke...

source: Add Document Files
nb: Tilføy Dokument Filer

source: Adding document files
nb: Tilføyd dokument filer

source: Got text
nb: Fått tekst

source: Got ID
nb: Fått ID

source: Got metadata
nb: Fått metadata

source: %1 of %2 documents
nb: %1 av %2 dokumenter

source: Cancelled
nb: Kansellert

source: Finished
nb: Fullført

source: Add Reference with ID
nb: Legg til Referanse med ID

source: Add Document
nb: Legg til Dokument

source: Add Folder
nb: Legg til mappe

source: Are you sure you want to remove these %1 documents?
nb: Er du sikker på at du vil fjerne disse %1 dokumenter?

source: Are you sure you want to remove '%1'?
nb: Er du sikker i å fjerne '%1'?

source: Really rename this file to '%1'?
nb: Vil du virkelig omdøpe den filen til '%1'?

source: This action <b>cannot be undone</b>.
nb: Denne handling <b>kan ikke bli ugjort</b>.

source: Rename from Key
nb: Endre navn fra Nøkkel

source: Are you sure you want to delete the files of these %1 documents?
nb: Er du sikker på at du vil slette filene av disse %1 dokumenter?

source: Are you sure you want to delete the file of '%1'?
nb: Er du sikker på at du vil slette filen '%1'?

source: Deleting '%1'
nb: Sletting '%1'

source: Trying to open file '%1'
nb: Prøver å åpne fil '%1'

source: Working offline
nb: Arbeider frakoblet

source: Working online
nb: Arbeider tilkoblet

source: Import References
nb: Omport Referanser

source: Bibliography Files
nb: Bibliografi Filer

source: Imported %1 BibTeX references
nb: Importert %1 BibTeX referanser

source: Work offline?
nb: Arbeid frakoblet?

source: _Stay Online
nb: _Forbli Tilkoblet

source: _Go Offline
nb: _Bytt til Frakoblet

source: Opening URI '%1' on server
nb: Åpner URI '%1' på tjener

source: Reading URI '%1' on server
nb: Leser URI '%1' på tjener

source: Closing URI '%1' on server
nb: Lukker URI '%1' på tjener

source: The operation underway was: "%1"
nb: Operasjonen underveis var: "%1"
